
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Режим = Параметры.Режим;
	
	Если Режим = "1" Тогда
		Элементы.ЛистыФайла2.Видимость = Ложь;
	Иначе
		Элементы.ЛистыФайла1.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИмяЛиста(Команда)
	
	ТекДанные = ЭтотОбъект["ЛистыФайла" + Режим].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Лист не выбран.";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	Объект["ИмяЛистаФайла" + Режим] = ТекДанные.ИмяЛиста;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	
КонецПроцедуры
