
&НаСервере
Процедура СравнениеСтрокЗаполнитьНаСервере()
	Объект.СравнениеСтрок.Очистить();
	Для Каждого Строка Из Объект.ВыводимыеКолонкиФайл1 Цикл
		
		ИндексСтроки = Строка.НомерСтроки - 1;
		//Если Строка.ТипЗначения = "Число" Тогда
			
			НоваяСтрока = Объект.СравнениеСтрок.Добавить();
			НоваяСтрока.Файл1 = Строка.Наименование;
			
			Попытка
				ВтораяСтрока = Объект.ВыводимыеКолонкиФайл2[ИндексСтроки];
				НоваяСтрока.Файл2 = ВтораяСтрока.Наименование;
			Исключение
			КонецПопытки;
			
		//КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СравнениеСтрокЗаполнить(Команда)
	СравнениеСтрокЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Файл1Открытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТабДок = ПолучитьТабДок("1");
	ТабДок.Показать(Объект.Файл1,, Истина);
КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция ПрочитатьТабДок(ИмяФайла)
	
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Прочитать(ИмяФайла);
	Возврат ТабДок;

	

КонецФункции // ПрочитатьТабДок()


&НаСервере
Процедура СравнитьНаСервере()
	// засекаем время
	ВремяНачала = ТекущаяДата();
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		
	// очишаем поле результата
	Объект.Результат.Очистить();
	
	// получим результат сравнения
	 ОбработкаОбъект.ВыполнитьСравнение();
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");	
	// переключимся на вкладку "Результат"
	Элементы.Настройки.ТекущаяСтраница = Элементы.РезультатСравнения;
	
	// установим ползунок в значение 100%
	//ЭлементыФормы.ПолосаРегулирования.Значение = 100;
	
	//УстановитьИсходнуюШиринуКолонок(ЭлементыФормы.ПолеРезультат);
	
	// выведем время
	ВремяОкончания = ТекущаяДата();
	РазницаВремени = ВремяОкончания - ВремяНачала;
	РазницаВремени = '00010101' + РазницаВремени;
	РазницаВремени = Формат(РазницаВремени,"ДЛФ=T");
	//ТекстСостояния = "Найдено различий: "+ВсегоРазличий+". Время выполнения: "+РазницаВремени;
	
	// индикация
	//ЭлементыФормы.Индикатор.Значение = 0;

КонецПроцедуры

&НаКлиенте
Процедура Сравнить(Команда)
	СравнитьНаСервере();
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ТипФайловПриИзменении(Элемент)
	
	Объект.ЭтоMXL = (Объект.ТипФайлов = "*.mxl");
	Объект.ЭтоXLS = (Объект.ТипФайлов = "*.xls");
	Объект.ЭтоXLSX = (Объект.ТипФайлов = "*.xlsx");
	СтрокаПоиска = СтрЗаменить(Объект.ТипФайлов,"*","");
	
	Если СтрНайти(Объект.Файл1, СтрокаПоиска, НаправлениеПоиска.СКонца, СтрДлина(Объект.Файл1))  = 0 Тогда
		Объект.Файл1 = "";
	КонецЕсли;
	
	Если СтрНайти(Объект.Файл2, СтрокаПоиска, НаправлениеПоиска.СКонца, СтрДлина(Объект.Файл2))  = 0 Тогда
		Объект.Файл2 = "";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Файл2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.Файл2 = ПолучитьРезультатВыбораФайла();
	Адрес = "";
	
	Если ЗначениеЗаполнено(Объект.Файл2) Тогда
		НачатьПомещениеФайла(Новый ОписаниеОповещения("Файл2НачалоВыбораЗавершение", ЭтаФорма, Новый Структура("Адрес", Адрес)), Адрес, Объект.Файл2, Ложь);
		ЗаполнитьКраткоеИмяФайла(Объект.Файл2,2);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите файл";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Объект.ИмяЛистаФайла2 = "";

КонецПроцедуры

&НаКлиенте
Функция ПолучитьРезультатВыбораФайла()
	
	Результат = "";
	
	Если Объект.ЭтоMXL Тогда
		Фильтр 	= "Табличный файл 1С (*.mxl)|*.mxl";
	ИначеЕсли Объект.ЭтоXLSX Тогда
		Фильтр 	= "Документ MS Excel (*.xlsx)|*.xlsx";
	ИначеЕсли Объект.ЭтоXLS Тогда
		Фильтр 	= "Документ MS Excel (*.xls)|*.xls";
	Иначе
		Возврат Результат;
	КонецЕсли;	
	
	Режим 	= РежимДиалогаВыбораФайла.Открытие;
	
	Диалог = Новый ДиалогВыбораФайла(Режим);
	Диалог.Фильтр 				= Фильтр;
	Диалог.МножественныйВыбор 	= Ложь;
	
	Если Диалог.Выбрать() Тогда
		Результат = Диалог.ПолноеИмяФайла;		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция АвтоЗаполнениеНачальныхКонечныхСтрокКолонок(номер)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.АвтоЗаполнениеНачальныхКонечныхСтрокКолонок(номер);
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");

КонецФункции // АвтоЗаполнениеНачальныхКонечныхСтрокКолонок("1")

&НаКлиенте
Процедура Файл1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.Файл1 = ПолучитьРезультатВыбораФайла();
	Адрес = "";
	
	Если ЗначениеЗаполнено(Объект.Файл1) Тогда
		НачатьПомещениеФайла(Новый ОписаниеОповещения("Файл1НачалоВыбораЗавершение", ЭтаФорма, Новый Структура("Адрес", Адрес)), Адрес,Объект.Файл1,Ложь);
		ЗаполнитьКраткоеИмяФайла(Объект.Файл1,1);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выберите файл";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Объект.ИмяЛистаФайла1 = "";
	
КонецПроцедуры

&НаКлиенте
Процедура Файл1НачалоВыбораЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	ЗагрузитьТабДокИзФайла(Адрес, "1", Объект.ИмяЛистаФайла1);
	АвтоЗаполнениеНачальныхКонечныхСтрокКолонок("1");
	ОбновитьОтображениеДанных();
		
КонецПроцедуры

&НаКлиенте
Процедура Файл2НачалоВыбораЗавершение(Результат, Адрес, Выбранно2еИмяФайла, ДополнительныеПараметры) Экспорт
	
	ЗагрузитьТабДокИзФайла(Адрес, "2", Объект.ИмяЛистаФайла2);
	АвтоЗаполнениеНачальныхКонечныхСтрокКолонок("2");
	ОбновитьОтображениеДанных();
	
	//ДопПараметры = Новый Структура("Режим, Адрес", "2", Адрес);
	//ОписаниеОповещения = Новый ОписаниеОповещения("ДействияПослеВыбораЛиста", ЭтаФорма, Новый Структура("Режим", "2")); 
	//ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.ФормаВыбораЛиста", ДопПараметры, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

Процедура ДействияПослеВыбораЛиста(Результат, ДополнительныеПараметры) Экспорт
	
	Режим = ДополнительныеПараметры.Режим;
	Адрес = ДополнительныеПараметры.Адрес;
	
	ЗагрузитьТабДокИзФайла(Адрес, Режим, Объект["ИмяЛистаФайла" + Режим]);
	АвтоЗаполнениеНачальныхКонечныхСтрокКолонок(Режим);
	ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура Файл2Открытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТабДок = ПолучитьТабДок("2");
	ТабДок.Показать(Объект.Файл2,, Истина);
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор(РежимОтбора)
ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
ОбработкаОбъект.ОтображениеРезультатаУстановитьОтбор(РежимОтбора);
ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьВсе(Команда)
	УстановитьОтбор("ОтборВсе");
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьОтличия(Команда)
	  УстановитьОтбор("ОтборОтличия");
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьПрисутствующиеВПервомФайле(Команда)
	 УстановитьОтбор("Отбор1");
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьПрисутствующиеВоВторомФайле(Команда)
УстановитьОтбор("Отбор2");	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТабДокИзФайла(Адрес, Режим, Знач ИмяЛиста = "")
	
	РеквизитСИменемЛиста = ?(Режим = "1", "ИмяЛистаФайла1", "ИмяЛистаФайла2");
	
	ИмяВременогоФайла = ПолучитьИмяВременногоФайла(СтрЗаменить(Объект.ТипФайлов, "*", ""));    
    Файл = ПолучитьИзВременногоХранилища(Адрес);
    Файл.Записать(ИмяВременогоФайла);
    ТабДок = Новый ТабличныйДокумент;
    ТабДок.Прочитать(ИмяВременогофайла);
	
	ТребуемыйТабДок = ?(Режим = "1", "Файл1ТабДок", "Файл2ТабДок");
	Объект[ТребуемыйТабДок] = ТабДок;
	
	Если НЕ Объект.ЭтоMXL Тогда
		
		Если ИмяЛиста = "" ИЛИ Элементы[РеквизитСИменемЛиста].СписокВыбора.Количество() = 0 Тогда
			
			ИмяТЧ = ?(Режим = "1", "ЛистыФайла1", "ЛистыФайла2");
			Объект[ИмяТЧ].Очистить();
			
			Элементы[РеквизитСИменемЛиста].СписокВыбора.Очистить();
			
			Для Каждого Область Из ТабДок.Области Цикл
				НовСтрока = Объект[ИмяТЧ].Добавить();
				НовСтрока.ИмяЛиста = Область.Имя;
				Элементы[РеквизитСИменемЛиста].СписокВыбора.Добавить(Область.Имя, Область.Имя);
			КонецЦикла;
			
			Объект[РеквизитСИменемЛиста] = Элементы[РеквизитСИменемЛиста].СписокВыбора[0];
			Объект[ТребуемыйТабДок] = Объект[ТребуемыйТабДок].ПолучитьОбласть(Элементы[РеквизитСИменемЛиста].СписокВыбора[0]);
			
		Иначе
			
			Объект[ТребуемыйТабДок] = Объект[ТребуемыйТабДок].ПолучитьОбласть(ИмяЛиста);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция ПолучитьТабДок(Режим)
 ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
 ТребуемыйТабДок = ?(Режим="1", "Файл1ТабДок", "Файл2ТабДок");
 Возврат ОбработкаОбъект[ТребуемыйТабДок];
	

КонецФункции // ПолучитьТабДок()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//++ Консист Холькин Е.В. 12.08.2021 
	Объект.ЭтоMXL = (Объект.ТипФайлов = "*.mxl");
	Объект.ЭтоXLS = (Объект.ТипФайлов = "*.xls");
	Объект.ЭтоXLSX = (Объект.ТипФайлов = "*.xlsx");
	//-- Консист Холькин Е.В. 12.08.2021 
	
	ПрочитатьФайл1();
	ПрочитатьФайл2();
	
	Объект.Файл1НачальнаяСтрока = 1;
	Объект.Файл2НачальнаяСтрока = 1;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыводимыеКолонкиНаСервере(Режим)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.АвтоЗаполнениеВыводимыхКолонок(Режим);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыводимыеКолонки(Команда)
	ЗаполнитьВыводимыеКолонкиНаСервере("1");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыводимыеКолонки2(Команда)
	ЗаполнитьВыводимыеКолонкиНаСервере("2");
КонецПроцедуры

&НаСервере
Процедура СопоставлениеСтрокЗаполнитьНаСервере()
	Объект.СопоставлениеСтрок.Очистить();
	Для Каждого Строка Из Объект.ВыводимыеКолонкиФайл1 Цикл
		
		ИндексСтроки = Строка.НомерСтроки - 1;
		Если Строка.ТипЗначения = "Текст" Тогда
			
			НоваяСтрока = Объект.СопоставлениеСтрок.Добавить();
			НоваяСтрока.Файл1 = Строка.Наименование;
			
			Попытка
				ВтораяСтрока = Объект.ВыводимыеКолонкиФайл2[ИндексСтроки];
				НоваяСтрока.Файл2 = ВтораяСтрока.Наименование;
			Исключение
			КонецПопытки;
			
		КонецЕсли;	
		
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеСтрокЗаполнить(Команда)
	СопоставлениеСтрокЗаполнитьНаСервере();
КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаКлиенте
Функция ЗаполнитьКраткоеИмяФайла(ПолноеИмяФайла, Режим)
	Если Режим = 1 Тогда
		Реквизит = "ИмяФайла1";
	Иначе
		Реквизит = "ИмяФайла2" ;
	КонецЕсли;
	ПозицияПоследнегоСлэша = СтрНайти(ПолноеИмяФайла,"\",НаправлениеПоиска.СКонца,,1);
	ДлинаСтроки = СтрДлина(ПолноеИмяФайла);
	ЧислоСимволов = ДлинаСтроки-ПозицияПоследнегоСлэша;
	КраткоеИмя = Прав(ПолноеИмяФайла,ЧислоСимволов);
	Объект[Реквизит] = КраткоеИмя;

	

КонецФункции // ЗАполнитьКраткоеИмяФайла()

//++ Консист Холькин Е.В. 12.08.2021 
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	 Настройки.Вставить("СопоставлениеСтрок", Объект.СопоставлениеСтрок.Выгрузить());
	 Настройки.Вставить("СравнениеСтрок", Объект.СравнениеСтрок.Выгрузить());
	 Настройки.Вставить("ВыводимыеКолонкиФайл1", Объект.ВыводимыеКолонкиФайл1.Выгрузить());
	 Настройки.Вставить("ВыводимыеКолонкиФайл2", Объект.ВыводимыеКолонкиФайл2.Выгрузить());
	 Настройки.Вставить("ЛистыФайла1", Объект.ЛистыФайла1.Выгрузить());
	 Настройки.Вставить("ЛистыФайла2", Объект.ЛистыФайла2.Выгрузить());
	
КонецПроцедуры 

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	// Попытка нужна для первого входа, пока произвольных сохраняемых значений в сохраненных настройках нет.
	
	Попытка
		Объект.СопоставлениеСтрок.Загрузить(Настройки.Получить("СопоставлениеСтрок"));
	Исключение
	КонецПопытки;
	
	Попытка
		Объект.СравнениеСтрок.Загрузить(Настройки.Получить("СравнениеСтрок"));
	Исключение
	КонецПопытки;
	
	Попытка
		Объект.ВыводимыеКолонкиФайл1.Загрузить(Настройки.Получить("ВыводимыеКолонкиФайл1"));
	Исключение
	КонецПопытки;
	
	Попытка
		Объект.ВыводимыеКолонкиФайл2.Загрузить(Настройки.Получить("ВыводимыеКолонкиФайл2"));
	Исключение
	КонецПопытки;
	
	Попытка
		Объект.ЛистыФайла1.Загрузить(Настройки.Получить("ЛистыФайла1"));
		Элементы.ИмяЛистаФайла1.СписокВыбора.ЗагрузитьЗначения(Объект.ЛистыФайла1.Выгрузить().ВыгрузитьКолонку("ИмяЛиста"));
	Исключение
	КонецПопытки;
	
	Попытка
		Объект.ЛистыФайла2.Загрузить(Настройки.Получить("ЛистыФайла2"));
		Элементы.ИмяЛистаФайла2.СписокВыбора.ЗагрузитьЗначения(Объект.ЛистыФайла2.Выгрузить().ВыгрузитьКолонку("ИмяЛиста"));
	Исключение
	КонецПопытки;
	
	Попытка
		Объект.ТипФайлов = Настройки.Получить("Объект.ТипФайлов");
	Исключение
	КонецПопытки;
	
	Попытка
		Объект.ЭтоMXL = (Объект.ТипФайлов = "*.mxl");
		Объект.ЭтоXLS = (Объект.ТипФайлов = "*.xls");
		Объект.ЭтоXLSX = (Объект.ТипФайлов = "*.xlsx");
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводимыеКолонкиФайл1ПриИзменении(Элемент)
	 СохраняемыеВНастройкахДанныеМодифицированы = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыводимыеКолонкиФайл2ПриИзменении(Элемент)
	 СохраняемыеВНастройкахДанныеМодифицированы = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеСтрокПриИзменении(Элемент)
	 СохраняемыеВНастройкахДанныеМодифицированы = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СравнениеСтрокПриИзменении(Элемент)
	 СохраняемыеВНастройкахДанныеМодифицированы = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл1()
	
	Адрес = "";
	
	Если ЗначениеЗаполнено(Объект.Файл1) Тогда 
		
		ЗаполнитьКраткоеИмяФайла(Объект.Файл1, 1);
		
		Попытка
			НачатьПомещениеФайла(Новый ОписаниеОповещения("Файл1НачалоВыбораЗавершение", ЭтаФорма, Новый Структура("Адрес", Адрес)), Адрес,Объект.Файл1, Ложь);			 			 
		Исключение
			Объект.Файл1 = "";
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл2()
	
	Адрес = "";
	
	Если ЗначениеЗаполнено(Объект.Файл2) Тогда 
		
		ЗаполнитьКраткоеИмяФайла(Объект.Файл2, 2);
		
		Попытка
			
			НачатьПомещениеФайла(Новый ОписаниеОповещения("Файл2НачалоВыбораЗавершение", ЭтаФорма, Новый Структура("Адрес", Адрес)), Адрес,Объект.Файл2, Ложь);
			
		Исключение
			Объект.Файл2 = "";					
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьФайл1(Команда)
	ПрочитатьФайл1();
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьФайл2(Команда)
	ПрочитатьФайл2();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяОбработки = Сред(Этаформа.ИмяФормы, СтрНайти(Этаформа.ИмяФормы, ".")+1, СтрНайти(Этаформа.ИмяФормы, ".Форма") - СтрНайти(Этаформа.ИмяФормы, ".")-1);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяЛистаФайла1ПриИзменении(Элемент)
	
	ПрочитатьФайл1();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяЛистаФайла2ПриИзменении(Элемент)
	
	ПрочитатьФайл2();
	
КонецПроцедуры
//-- Консист Холькин Е.В. 12.08.2021 
