Перем ПризнакРавно				Экспорт; // Признаки сравнения.
Перем ПризнакНеРавно 			Экспорт;
Перем ПризнакТолько1 			Экспорт;
Перем ПризнакТолько2 			Экспорт;
Перем АдресСтраницы				Экспорт; // Адрес разработки на Infostart.ru.
Перем ВыводитьРазницу			Экспорт; // Флаг, выводить ли разницу числовых сравниваемых колонок.
Перем мИндикатор				Экспорт; // Элемент формы "Индикатор".
Перем ВсегоРазличий				Экспорт; // Количество найденных различий при сравнении файлов.
Перем ИменаКолонок1				Экспорт; // Соответствия, хранящее заданые имена колонок.
Перем ИменаКолонок2				Экспорт; 
Перем ТипыКолонок1				Экспорт; // Соответствия, хранящее заданые типы колонок.
Перем ТипыКолонок2				Экспорт; 
Перем ИсходнаяШиринаКолонок 	Экспорт; // Соответствие, хранящее исходную ширину колонок табличного поля-результата.
Перем СоответствиеИменКолонок1 	Экспорт; //Консист Холькин Е.В. 13.08.2021
Перем СоответствиеИменКолонок2 	Экспорт; //Консист Холькин Е.В. 13.08.2021

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "2026.08.27";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Сравнение табличных документов'");
	Команда.Идентификатор = "Сравнение табличных документов";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	
	Возврат ПараметрыРегистрации;
	
КонецФункции 

Процедура ВыполнитьСравнение() Экспорт
	
	//++ Консист Холькин Е.В. 13.08.2021 
	СоответствиеИменКолонок1 = Новый Соответствие;
	СоответствиеИменКолонок2 = Новый Соответствие;
	//-- Консист Холькин Е.В. 13.08.2021 
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	// обнулим соответствия
	ИменаКолонок1 = Новый Соответствие;
	ИменаКолонок2 = Новый Соответствие;
	
	ТипыКолонок1 = Новый Соответствие;
	ТипыКолонок2 = Новый Соответствие;
	
	// проверка правильности заполнения необходимых данных
	Отказ = ПроверитьКорректностьЗаполнения();
	Если Отказ Тогда
		Возврат ;
	КонецЕсли;
	
	// получим таблицы файлов необходимой структуры
	Таблица1 = ПолучитьСтруктуруТаблицы("1");
	Таблица2 = ПолучитьСтруктуруТаблицы("2");
	
	ЗаполнитьТаблицуMXL("1",Таблица1);
	ЗаполнитьТаблицуMXL("2",Таблица2);
	
	
	Если Таблица1.Количество() = 0 Тогда
		Возврат ;
	КонецЕсли;
	
	// преобразуем числовые строки в числа
	ПреобразоватьЧисловыеСтроки("1",Таблица1);
	ПреобразоватьЧисловыеСтроки("2",Таблица2);
	
	// признак вывода разницы
	ВыводитьРазницу = ПроверитьВозможностьВыводаРазницы();
	
	// добавим в таблицы регистронезависимые колонки
	Если НеУчитыватьРегистр Тогда
		ДобавитьРегистронезависимыеКолонки("2",Таблица2);
	КонецЕсли;	
	
	// собственно, сравнение
	Если ПоследовательноеСравнение Тогда
		ТабДокумент = СравнитьТаблицыПоследовательно(Таблица1,Таблица2);
	Иначе
		ТабДокумент = СравнитьТаблицы(Таблица1,Таблица2);
	КонецЕсли;	
	
	  Результат = ТабДокумент;
	
КонецПроцедуры

// формирование таблиц, необходимой структуры
Функция ПолучитьСтруктуруТаблицы(Режим)
	
	Таблица = Новый ТаблицаЗначений;
	
	ИмяРеквизитаНачало 	= "Файл"+Режим+"НачальнаяКолонка";
	ИмяРеквизитаКонец 	= "Файл"+Режим+"КонечнаяКолонка";
	
	Начало 	= ЭтотОбъект[ИмяРеквизитаНачало];
	Конец	= ЭтотОбъект[ИмяРеквизитаКонец];
	
	Для i = Начало По Конец Цикл
		
		ИмяКолонки = "К"+i;
		Таблица.Колонки.Добавить(ИмяКолонки);
		
	КонецЦикла;	
	
	Возврат Таблица;
	
КонецФункции	

// проверка корректности заполнения необходимых настроек
Функция ПроверитьКорректностьЗаполнения()
	
	СписокОшибок 	= Новый Массив;
	Отказ 			= Ложь;
	
	// тип файлов
	Если НЕ ЗначениеЗаполнено(ТипФайлов) Тогда
		СписокОшибок.Добавить("Не указан тип файлов");
	КонецЕсли;	
	
	// файлы
	Если НЕ ЗначениеЗаполнено(Файл1) Тогда
		СписокОшибок.Добавить("Не указан первый файл");
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Файл2) Тогда
		СписокОшибок.Добавить("Не указан второй файл");
	КонецЕсли;	
	
	// начальные и конечные строки и колонки
	// первый файл
	Если НЕ ЗначениеЗаполнено(Файл1НачальнаяСтрока) Тогда
		СписокОшибок.Добавить("Не указана начальная строка первого файла");
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Файл1КонечнаяСтрока) Тогда
		СписокОшибок.Добавить("Не указана конечная строка первого файла");
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Файл1НачальнаяКолонка) Тогда
		СписокОшибок.Добавить("Не указана начальная колонка первого файла");
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Файл1КонечнаяКолонка) Тогда
		СписокОшибок.Добавить("Не указана конечная колонка первого файла");
	КонецЕсли;	
	// второй файл
	Если НЕ ЗначениеЗаполнено(Файл2НачальнаяСтрока) Тогда
		СписокОшибок.Добавить("Не указана начальная строка второго файла");
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Файл2КонечнаяСтрока) Тогда
		СписокОшибок.Добавить("Не указана конечная строка второго файла");
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Файл2НачальнаяКолонка) Тогда
		СписокОшибок.Добавить("Не указана начальная колонка второго файла");
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Файл2КонечнаяКолонка) Тогда
		СписокОшибок.Добавить("Не указана конечная колонка второго файла");
	КонецЕсли;	
	
	// правильность указания строк и колонок
	Если Файл1КонечнаяСтрока < Файл1НачальнаяСтрока Тогда
		СписокОшибок.Добавить("Неверно указано расположение строк первого файла");
	КонецЕсли;	
	Если Файл2КонечнаяСтрока < Файл2НачальнаяСтрока Тогда
		СписокОшибок.Добавить("Неверно указано расположение строк второго файла");
	КонецЕсли;	
	Если Файл1КонечнаяКолонка < Файл1НачальнаяКолонка Тогда
		СписокОшибок.Добавить("Неверно указано расположение колонок первого файла");
	КонецЕсли;	
	Если Файл2КонечнаяКолонка < Файл2НачальнаяКолонка Тогда
		СписокОшибок.Добавить("Неверно указано расположение колонок второго файла");
	КонецЕсли;	
	
	// сопоставление строк
	Если СопоставлениеСтрок.Количество() = 0 Тогда
		СписокОшибок.Добавить("Не указано соспоставление строк по колонкам");
	Иначе	
		Для Каждого Строка Из СопоставлениеСтрок Цикл
			
			// заполненность колонок
			Если НЕ ЗначениеЗаполнено(Строка.Файл1) ИЛИ НЕ ЗначениеЗаполнено(Строка.Файл2) Тогда
				СписокОшибок.Добавить("Сопоставление строк, строка "+Строка.НомерСтроки+": некорректно указана настройка");
			//Иначе
			//	
			//	Если Строка.Файл1 < Файл1НачальнаяКолонка ИЛИ Строка.Файл1 > Файл1КонечнаяКолонка Тогда
			//		СписокОшибок.Добавить("Сопоставление строк, строка "+Строка.НомерСтроки+": колонка первого файла должна быть в диапазоне ["+Файл1НачальнаяКолонка+".."+Файл1КонечнаяКолонка+"]");
			//	КонецЕсли;	
			//	Если Строка.Файл2 < Файл2НачальнаяКолонка ИЛИ Строка.Файл2 > Файл2КонечнаяКолонка Тогда
			//		СписокОшибок.Добавить("Сопоставление строк, строка "+Строка.НомерСтроки+": колонка аторого файла должна быть в диапазоне ["+Файл2НачальнаяКолонка+".."+Файл2КонечнаяКолонка+"]");
			//	КонецЕсли;	
				
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;	
	
	// сравнение строк
	Если СравнениеСтрок.Количество() = 0 Тогда
		СписокОшибок.Добавить("Не указано сравнение строк по колонкам");
	Иначе	
		Для Каждого Строка Из СравнениеСтрок Цикл
			Если НЕ ЗначениеЗаполнено(Строка.Файл1) ИЛИ НЕ ЗначениеЗаполнено(Строка.Файл2) Тогда
				СписокОшибок.Добавить("Сравнение строк, строка "+Строка.НомерСтроки+": некорректно указана настройка");
			Иначе
				// проверим диапазон
				//Если Строка.Файл1 < Файл1НачальнаяКолонка ИЛИ Строка.Файл1 > Файл1КонечнаяКолонка Тогда
				//	СписокОшибок.Добавить("Сравнение строк, строка "+Строка.НомерСтроки+": колонка первого файла должна быть в диапазоне ["+Файл1НачальнаяКолонка+".."+Файл1КонечнаяКолонка+"]");
				//КонецЕсли;	
				//Если Строка.Файл2 < Файл2НачальнаяКолонка ИЛИ Строка.Файл2 > Файл2КонечнаяКолонка Тогда
				//	СписокОшибок.Добавить("Сравнение строк, строка "+Строка.НомерСтроки+": колонка второго файла должна быть в диапазоне ["+Файл2НачальнаяКолонка+".."+Файл2КонечнаяКолонка+"]");
				//КонецЕсли;
				// поле сравнения обязательно должно быть в выводимых полях
				//ЕстьПоле = Ложь;
				//Для Каждого ВыводимаяКолонка Из ВыводимыеКолонкиФайл1 Цикл
				//	Если ВыводимаяКолонка.Наименование = Строка.Файл1 Тогда
				//		ЕстьПоле = Истина;
				//		Прервать;
				//	КонецЕсли;	
				//КонецЦикла;
				//Если НЕ ЕстьПоле Тогда
				//	СписокОшибок.Добавить("Сравнение строк, строка "+Строка.НомерСтроки+": колонка первого файла должна быть включена в список выводимых колонок");
				//КонецЕсли;	
				//
				//ЕстьПоле = Ложь;
				//Для Каждого ВыводимаяКолонка Из ВыводимыеКолонкиФайл2 Цикл
				//	Если ВыводимаяКолонка.НомерКолонки = Строка.Файл2 Тогда
				//		ЕстьПоле = Истина;
				//		Прервать;
				//	КонецЕсли;	
				//КонецЦикла;
				//Если НЕ ЕстьПоле Тогда
				//	СписокОшибок.Добавить("Сравнение строк, строка "+Строка.НомерСтроки+": колонка второго файла должна быть включена в список выводимых колонок");
				//КонецЕсли;	
				
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
	
	Если СписокОшибок.Количество() > 0 Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Для Каждого Ошибка Из СписокОшибок Цикл
			Сообщение.Текст = Ошибка;
			Сообщение.Сообщить(); 
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции	

// заполнения таблицы из файла MXL
Процедура ЗаполнитьТаблицуMXL(Режим,Таблица)

	ТабДок = ?(Режим = "1", Файл1ТабДок, Файл2ТабДок);
	
	//СтрокаНачало 	= ?(Режим = "1", Файл1НачальнаяСтрока, Файл2НачальнаяСтрока);
	СтрокаКонец 	= ?(Режим = "1", Файл1КонечнаяСтрока, Файл2КонечнаяСтрока);
	СтрокаНачало  =?(Режим = "1", Файл1НачальнаяСтрока, Файл2НачальнаяСтрока);
	
	КолонкаНачало 	= ?(Режим = "1", Файл1НачальнаяКолонка, Файл2НачальнаяКолонка);
	КолонкаКонец 	= ?(Режим = "1", Файл1КонечнаяКолонка, Файл2КонечнаяКолонка);
	
	//ТабДок = Новый ТабличныйДокумент;
	//ТабДок.Прочитать(мФайл);
	Заголовок = ТабДок.Область("R1C2");
		
		
	
	
		
	//Для ТекущаяСтрока = СтрокаНачало По СтрокаКонец Цикл
	//	
	//			
	//	// возможность прервать работу
	//	//ОбработкаПрерыванияПользователя();
	//	
	//	// чтение файла
	//	//мТекущаяСтрока = ПолучитьСтроку(ТекущаяСтрока);
	//	
	//	НоваяСтрока = Таблица.Добавить();
	//	
	//	Для ТекущаяКолонка = КолонкаНачало По КолонкаКонец Цикл
	//		
	//		Ячейка = ТабДок.Область("R"+Формат(ТекущаяСтрока,"ЧГ=0")+"C"+Формат(ТекущаяКолонка,"ЧГ=0"));
	//		Значение = Ячейка.Текст;
	//		Если ОбрезатьПробелы Тогда
	//			Значение = СокрЛП(Значение);
	//		КонецЕсли;
	//		
	//		
	//		
	//		ИмяКолонки = "К"+ТекущаяКолонка;
	//		НоваяСтрока[ИмяКолонки] = Значение;
	//		
	//	КонецЦикла;	
	//	
	//КонецЦикла;	
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область("R"+СтрокаНачало+"C"+КолонкаНачало+":R" + Формат(СтрокаКонец, "ЧГ=0") + "C" + Формат(КолонкаКонец, "ЧГ=0")));
	Таблица = Построитель.Результат.Выгрузить();
	
	//Для каждого Колонка Из Таблица.Колонки  Цикл
	//	Колонка.Имя = "К"+ Строка(Таблица.Колонки.Индекс(Колонка)+1);  		
	//
	//КонецЦикла; 	
	//Возврат ТаблицаПостроитель
	
	// очистим память
	//ТабДок = 0;
	
КонецПроцедуры	

// последовательное сравнение таблиц
Функция СравнитьТаблицыПоследовательно(Знач Таблица1, Знач Таблица2)
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	
	СтруктураДокумента = Новый Структура;
	
	// шапка документа
	//ВывестиШапку(ТабДокумент, Макет, Таблица1, Таблица2, СтруктураДокумента);

	// теперь сравниваем строки последовательно
	// первая таблица основная
	КоличествоСтрок1 = Таблица1.Количество() - 1;
	КоличествоСтрок2 = Таблица2.Количество() - 1;
	
	ВсегоЗаписей = КоличествоСтрок1;
	ОбработаноЗаписей = 0;
	Если НЕ мИндикатор = Неопределено Тогда
		мИндикатор.МаксимальноеЗначение = ВсегоЗаписей;
	КонецЕсли;	
	
	// количество различий
	ВсегоРазличий = 0;
	
	Для i = 0 По КоличествоСтрок1 Цикл
		
				
		// возможность прервать работу
		//ОбработкаПрерыванияПользователя();
		
		// сравнение
		Строка1 = Таблица1[i];
		Строка2 = Неопределено;
		Если i <= КоличествоСтрок2 Тогда
			Строка2 = Таблица2[i];
		КонецЕсли;	
		
		// Вариант 1. Строки есть в обоих файлах. Необходимо сравнение
		Если Строка2 <> Неопределено Тогда
			
			// если поля сопоставления совпадают, это будет одна строка, иначе - 2
			ЭтоОднаСтрока = Истина;
			Для Каждого СтрокаСопоставления Из СопоставлениеСтрок Цикл
				
				//++ Консист Холькин Е.В. 12.08.2021 
				//Колонка1 = "К"+СтрокаСопоставления.Файл1;
				//Колонка2 = "К"+СтрокаСопоставления.Файл2;
				Колонка1 = СтрокаСопоставления.Файл1;
				Колонка2 = СтрокаСопоставления.Файл2;
				//-- Консист Холькин Е.В. 12.08.2021 
				
				ЛевоеЗначение 	= Строка1[Колонка1];
				ПравоеЗначение 	= Строка2[Колонка2];
				
				// регистронезависимое сравнение
				Если НеУчитыватьРегистр Тогда
					
					// сравнение без учета регистра имеет смысл только для строк
					Если ТипЗнч(ЛевоеЗначение) = Тип("Строка") И ТипЗнч(ПравоеЗначение) = Тип("Строка") Тогда
						
						Если ВРег(ЛевоеЗначение) <> ВРег(ПравоеЗначение) Тогда
							ЭтоОднаСтрока = Ложь;
							Прервать;
						КонецЕсли;
						
					Иначе
						
						Если ЛевоеЗначение <> ПравоеЗначение Тогда
							ЭтоОднаСтрока = Ложь;
							Прервать;
						КонецЕсли;
						
					КонецЕсли;
					
				// регистрозависимое сравнение	
				Иначе	
				
					Если ЛевоеЗначение <> ПравоеЗначение Тогда
						ЭтоОднаСтрока = Ложь;
						Прервать;
					КонецЕсли;
				
				КонецЕсли;
				
			КонецЦикла;
			
			// Нюанс 1. Это одна строка. Необходимо сравнить поля сравнения
			Если ЭтоОднаСтрока Тогда
				
				Для Каждого СтрокаСравнения Из СравнениеСтрок Цикл
					
					//++ Консист Холькин Е.В. 12.08.2021 
					//Колонка1 = "К"+СтрокаСравнения.Файл1;
					//Колонка2 = "К"+СтрокаСравнения.Файл2;
					Колонка1 = СтрокаСравнения.Файл1;
					Колонка2 = СтрокаСравнения.Файл2;
					//-- Консист Холькин Е.В. 12.08.2021 
					
					Признак = ПризнакРавно;
					
					ЛевоеЗначение 	= Строка1[Колонка1];
					ПравоеЗначение 	= Строка2[Колонка2];
					
					// регистронезависимое сравнение
					Если НеУчитыватьРегистр Тогда
						
						// сравнение без учета регистра имеет смысл только для строк
						Если ТипЗнч(ЛевоеЗначение) = Тип("Строка") И ТипЗнч(ПравоеЗначение) = Тип("Строка") Тогда
							
							Если ВРег(ЛевоеЗначение) <> ВРег(ПравоеЗначение) Тогда
								Признак = ПризнакНеРавно;
								Прервать;
							КонецЕсли;
							
						Иначе
							
							Если ЛевоеЗначение <> ПравоеЗначение Тогда
								Признак = ПризнакНеРавно;
								Прервать;
							КонецЕсли;
							
						КонецЕсли;
						
					// регистрозависимое сравнение	
					Иначе	
					
						Если ЛевоеЗначение <> ПравоеЗначение Тогда
							Признак = ПризнакНеРавно;
							Прервать;
						КонецЕсли;
					
					КонецЕсли;
					
				КонецЦикла;	
				
				// выводим, если в настройках не сказано: "Не выводить совпадающие"
				Если Признак <> ПризнакРавно ИЛИ НеВыводитьОдинаковыеСтроки = Ложь Тогда

					// признак
					ВывестиПризнак(ТабДокумент, Макет, Признак);
					
					// строка таблицы 1
					ВывестиСтроку(ТабДокумент, Макет, "1", Таблица1, Строка1);	
					
					// пробел
					ВывестиПробел(ТабДокумент, Макет);
					
					// строка таблицы 2
					ВывестиСтроку(ТабДокумент, Макет, "2", Таблица2, Строка2);
					
					// разница
					Если ВыводитьРазницу Тогда
						
						// пробел
						ВывестиПробел(ТабДокумент, Макет);
						
						// разница
						ВывестиРазницу(ТабДокумент, Макет, Строка1, Строка2);
						
					КонецЕсли;	
					
				КонецЕсли;
				
				// количество различий
				Если Признак <> ПризнакРавно Тогда
					ВсегоРазличий = ВсегоРазличий + 1;
				КонецЕсли;
				
			// Нюанс 2. Разделяем на две разные строки
			Иначе
				
				// строка 1: только в первом файле
				// признак
				ВывестиПризнак(ТабДокумент, Макет, ПризнакТолько1);
				
				// строка таблицы 1
				ВывестиСтроку(ТабДокумент, Макет, "1", Таблица1, Строка1);	
				
				// пробел
				ВывестиПробел(ТабДокумент, Макет);
				
				// строка таблицы 2
				ВывестиСтроку(ТабДокумент, Макет, "2", Таблица2, Неопределено);	
				
				// разница
				Если ВыводитьРазницу Тогда
					
					// пробел
					ВывестиПробел(ТабДокумент, Макет);
					
					// разница
					ВывестиРазницу(ТабДокумент, Макет, Строка1, Неопределено);
					
				КонецЕсли;	
				
				// строка 2: только во втором файле
				// признак
				ВывестиПризнак(ТабДокумент, Макет, ПризнакТолько2);
				
				// строка таблицы 1
				ВывестиСтроку(ТабДокумент, Макет, "1", Таблица1, Неопределено);	
				
				// пробел
				ВывестиПробел(ТабДокумент, Макет);
				
				// строка таблицы 2
				ВывестиСтроку(ТабДокумент, Макет, "2", Таблица2, Строка2);	
				
				// разница
				Если ВыводитьРазницу Тогда
					
					// пробел
					ВывестиПробел(ТабДокумент, Макет);
					
					// разница
					ВывестиРазницу(ТабДокумент, Макет, Неопределено, Строка2);
					
				КонецЕсли;	
				
				// количество различий
				ВсегоРазличий = ВсегоРазличий + 2;
				
			КонецЕсли;	
			
		// Вариант 2. Строка во втором файле отсутствует	
		Иначе
			
			// признак
			ВывестиПризнак(ТабДокумент, Макет, ПризнакТолько1);
			
			// ячейки первой таблицы
			ВывестиСтроку(ТабДокумент, Макет, "1", Таблица1, Строка1);
			
			// пробел
			ВывестиПробел(ТабДокумент, Макет);
			
			// пустые ячейки второй таблицы
			ВывестиСтроку(ТабДокумент, Макет, "2", Таблица2, Неопределено);	
			
			// разница
			Если ВыводитьРазницу Тогда
				
				// пробел
				ВывестиПробел(ТабДокумент, Макет);
				
				// разница
				ВывестиРазницу(ТабДокумент, Макет, Строка1, Неопределено);
				
			КонецЕсли;	
			
			// количество различий
			ВсегоРазличий = ВсегоРазличий + 1;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	// если во второй таблице строк больше, чем в первой, выводим их в конце
	Если КоличествоСтрок2 > КоличествоСтрок1 Тогда
		
		мНачало = КоличествоСтрок1 + 1;
		Для i = мНачало По КоличествоСтрок2 Цикл
			
			Строка2 = Таблица2[i];
			
			// признак
			ВывестиПризнак(ТабДокумент, Макет, ПризнакТолько2);
			
			// пустые ячейки первой таблицы
			ВывестиСтроку(ТабДокумент, Макет, "1", Таблица1, Неопределено);
			
			// пробел
			ВывестиПробел(ТабДокумент, Макет);
			
			// ячейки второй таблицы
			ВывестиСтроку(ТабДокумент, Макет, "2", Таблица2, Строка2);	
			
			// разница
			Если ВыводитьРазницу Тогда
				
				// пробел
				ВывестиПробел(ТабДокумент, Макет);
				
				// разница
				ВывестиРазницу(ТабДокумент, Макет, Неопределено, Строка2);
				
			КонецЕсли;	
			
			// количество различий
			ВсегоРазличий = ВсегоРазличий + 1;
			
		КонецЦикла;	
		
	КонецЕсли; // Если КоличествоСтрок2 > КоличествоСтрок1 Тогда	
	
	// раскрасим документ
	РаскраситьСтроки(ТабДокумент,СтруктураДокумента);
	
	// рассчитаем ширину колонок
	РасчетШириныКолонок(ТабДокумент);
	
	// расшифровка цветов
	Если ВыводитьРасшифровкуЦветов Тогда
		ВывестиРасшифровкуЦветов(ТабДокумент, Макет);
	КонецЕсли;	
	
	Возврат ТабДокумент;
	
КонецФункции	

// обычное сравнение таблиц
Функция СравнитьТаблицы(Знач Таблица1, Знач Таблица2)
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	
	СтруктураДокумента = Новый Структура;
	
	// шапка документа
	ВывестиШапку(ТабДокумент, Макет, Таблица1, Таблица2, СтруктураДокумента);
	
	// теперь сравниваем строки
	// первая таблица основная, во второй ищем подходящие строки
	КоличествоСтрок1 = Таблица1.Количество() - 1;
	КоличествоСтрок2 = Таблица2.Количество() - 1;
	
	ВсегоЗаписей = КоличествоСтрок1;
	ОбработаноЗаписей = 0;
	Если НЕ мИндикатор = Неопределено Тогда
		мИндикатор.МаксимальноеЗначение = ВсегоЗаписей;
	КонецЕсли;	
	
	// количество несовпадений
	ВсегоРазличий = 0;
	
	Для i = 0 По КоличествоСтрок1 Цикл
		
		//++ Консист Холькин Е.В. 12.08.2021 
		ИменаОтличающихсяКолонокФайла1 = Новый Массив;
		ИменаОтличающихсяКолонокФайла2 = Новый Массив;
		Признак = ПризнакРавно;
		//-- Консист Холькин Е.В. 12.08.2021 
				
		// сравнение
		Строка1 = Таблица1[i];
		
		//Если Строка1.К1 = "927" ИЛИ Строка1.К1 = "" Тогда
			//Для Каждого СтрокаСопоставления Из СопоставлениеСтрок Цикл
			//	Отбор =  Новый  Структура;
			//	ЗначениеОтбора = Строка1["К2"] ;
			//	КолонкаФайл2 = "К3";
			//	Отбор.Вставить(КолонкаФайл2,ЗначениеОтбора);
			//КонецЦикла;
		//Иначе
			 Отбор = ПолучитьСтруктуруОтбора(Строка1);
             			
		//КонецЕсли;     		
				
		Строки2 = Таблица2.НайтиСтроки(Отбор);
		НайденоСтрок = Строки2.Количество();
		
		// вариант 1. Найдена 1 и более строка
		Если НайденоСтрок >= 1 Тогда
		
			Строка2 = Строки2[0];
			
			Для Каждого СтрокаСравнения Из СравнениеСтрок Цикл
				
				Колонка1 =СтрокаСравнения.Файл1;
				Колонка2 = СтрокаСравнения.Файл2;
				
				//Признак = ПризнакРавно; //Консист Холькин Е.В. 13.08.2021 
				
				ЛевоеЗначение 	= Строка1[Колонка1];
				ПравоеЗначение 	= Строка2[Колонка2];
				
				//++ Консист Холькин Е.В. 17.08.2021 
				Если ТипЗнч(ЛевоеЗначение) = Тип("Строка") И ОбрезатьПробелы Тогда
					ЛевоеЗначение = СокрЛП(ЛевоеЗначение);	
				КонецЕсли;
				
				Если ТипЗнч(ПравоеЗначение) = Тип("Строка") И ОбрезатьПробелы Тогда
					ПравоеЗначение = СокрЛП(ПравоеЗначение);	
				КонецЕсли;
				//-- Консист Холькин Е.В. 17.08.2021			
				
				// регистронезависимое сравнение
				Если НеУчитыватьРегистр Тогда
					
					// сравнение без учета регистра имеет смысл только для строк
					Если ТипЗнч(ЛевоеЗначение) = Тип("Строка") И ТипЗнч(ПравоеЗначение) = Тип("Строка") Тогда
						
						Если ВРег(ЛевоеЗначение) <> ВРег(ПравоеЗначение) Тогда
							
							//++ Консист Холькин Е.В. 12.08.2021
							ИменаОтличающихсяКолонокФайла1.Добавить(Колонка1);
							ИменаОтличающихсяКолонокФайла2.Добавить(Колонка2);
							//-- Консист Холькин Е.В. 12.08.2021
							
							Признак = ПризнакНеРавно;
							//Прервать; //Консист Холькин Е.В. 13.08.2021 
						КонецЕсли;
						
					Иначе
						
						Если ЛевоеЗначение <> ПравоеЗначение Тогда
							
							//++ Консист Холькин Е.В. 12.08.2021
							ИменаОтличающихсяКолонокФайла1.Добавить(Колонка1);
							ИменаОтличающихсяКолонокФайла2.Добавить(Колонка2);
							//-- Консист Холькин Е.В. 12.08.2021
							
							Признак = ПризнакНеРавно;
							//Прервать; //Консист Холькин Е.В. 13.08.2021
						КонецЕсли;
						
					КонецЕсли;
					
					// регистрозависимое сравнение	
				Иначе	
					
					Если ЛевоеЗначение <> ПравоеЗначение Тогда
						
						//++ Консист Холькин Е.В. 12.08.2021
						ИменаОтличающихсяКолонокФайла1.Добавить(Колонка1);
						ИменаОтличающихсяКолонокФайла2.Добавить(Колонка2);
						//-- Консист Холькин Е.В. 12.08.2021 
						
						Признак = ПризнакНеРавно;
						//Прервать; //Консист Холькин Е.В. 13.08.2021
					КонецЕсли;
				
				КонецЕсли;
				
			КонецЦикла;	
			
			// выводим, если в настройках не сказано: "Не выводить совпадающие"
			Если Признак <> ПризнакРавно ИЛИ НеВыводитьОдинаковыеСтроки = Ложь Тогда

				// признак
				ВывестиПризнак(ТабДокумент, Макет, Признак);
				
				//++ Консист Холькин Е.В. 12.08.2021 
				ВывестиРазныеКолонки(ТабДокумент, Макет, ИменаОтличающихсяКолонокФайла1, 1);
				ВывестиРазныеКолонки(ТабДокумент, Макет, ИменаОтличающихсяКолонокФайла2, 2);
				//-- Консист Холькин Е.В. 12.08.2021 
				
				// строка таблицы 1
				ВывестиСтроку(ТабДокумент, Макет, "1", Таблица1, Строка1);	
				
				// пробел
				ВывестиПробел(ТабДокумент, Макет);
				
				// строка таблицы 2
				ВывестиСтроку(ТабДокумент, Макет, "2", Таблица2, Строка2);
				
				// разница
				Если ВыводитьРазницу Тогда
					
					// пробел
					ВывестиПробел(ТабДокумент, Макет);
					
					// разница
					ВывестиРазницу(ТабДокумент, Макет, Строка1, Строка2);
					
				КонецЕсли;	
				
			КонецЕсли;
			
			// количество различий
			Если Признак <> ПризнакРавно Тогда
				ВсегоРазличий = ВсегоРазличий + 1;
			КонецЕсли;
			
			// удаляем строку из второй таблицы, чтоб не мешалась дальше
			Таблица2.Удалить(Строка2);
			
		// вариант 2. Строки не найдены
		ИначеЕсли НайденоСтрок = 0 Тогда
			
			// признак
			ВывестиПризнак(ТабДокумент, Макет, ПризнакТолько1);
			
			//++ Консист Холькин Е.В. 12.08.2021 
			ВывестиРазныеКолонки(ТабДокумент, Макет, ИменаОтличающихсяКолонокФайла1, 1);
			ВывестиРазныеКолонки(ТабДокумент, Макет, ИменаОтличающихсяКолонокФайла2, 2);
			//-- Консист Холькин Е.В. 12.08.2021
			
			// строка таблицы 1
			ВывестиСтроку(ТабДокумент, Макет, "1", Таблица1, Строка1);	
			
			// пробел
			ВывестиПробел(ТабДокумент, Макет);
			
			// пустая строка таблицы 2
			ВывестиСтроку(ТабДокумент, Макет, "2", Таблица2, Неопределено);	
			
			// разница
			Если ВыводитьРазницу Тогда
				
				// пробел
				ВывестиПробел(ТабДокумент, Макет);
				
				// разница
				ВывестиРазницу(ТабДокумент, Макет, Строка1, Неопределено);
				
			КонецЕсли;	
			
			// количество различий
			ВсегоРазличий = ВсегоРазличий + 1;
			
		КонецЕсли;
		
	КонецЦикла; // цикл по обходу первой таблицы	
	
	// если во второй таблице остались строки, выводим их в конце
	Если Таблица2.Количество() > 0 Тогда
		
		Для Каждого Строка2 Из Таблица2 Цикл
			
			// признак
			ВывестиПризнак(ТабДокумент, Макет, ПризнакТолько2);
			
			//++ Консист Холькин Е.В. 12.08.2021 
			ВывестиРазныеКолонки(ТабДокумент, Макет, ИменаОтличающихсяКолонокФайла1, 1);
			ВывестиРазныеКолонки(ТабДокумент, Макет, ИменаОтличающихсяКолонокФайла2, 2);
			//-- Консист Холькин Е.В. 12.08.2021
			
			// пустые ячейки первой таблицы
			ВывестиСтроку(ТабДокумент, Макет, "1", Таблица1, Неопределено);
			
			// пробел
			ВывестиПробел(ТабДокумент, Макет);
			
			// ячейки второй таблицы
			ВывестиСтроку(ТабДокумент, Макет, "2", Таблица2, Строка2);	
			
			// разница
			Если ВыводитьРазницу Тогда
				
				// пробел
				ВывестиПробел(ТабДокумент, Макет);
				
				// разница
				ВывестиРазницу(ТабДокумент, Макет, Неопределено, Строка2);
				
			КонецЕсли;	
			
			// количество различий
			ВсегоРазличий = ВсегоРазличий + 1;
			
		КонецЦикла;	
		
	КонецЕсли; 	
	
	// раскрасим документ
	РаскраситьСтроки(ТабДокумент,СтруктураДокумента);
	
	// рассчитаем ширину колонок
	РасчетШириныКолонок(ТабДокумент);
	
	// расшифровка цветов
	Если ВыводитьРасшифровкуЦветов Тогда
		ВывестиРасшифровкуЦветов(ТабДокумент, Макет);
	КонецЕсли;	
	
	Возврат ТабДокумент;
	
КонецФункции	

// вывод шапки в табличный документ
Процедура ВывестиШапку(ТабДокумент, Макет, Знач Таблица1, Знач Таблица2, СтруктураДокумента)
	
	Область = Макет.ПолучитьОбласть("Шапка|Признак");
	Область.Параметры.Признак = ПризнакРавно;
	ТабДокумент.Вывести(Область);
	
	//++ Консист Холькин Е.В. 13.08.2021 
	Область = Макет.ПолучитьОбласть("Шапка|РазныеКолонки1");
	ТабДокумент.Присоединить(Область);
	
	Область = Макет.ПолучитьОбласть("Шапка|РазныеКолонки2");
	ТабДокумент.Присоединить(Область);
	//-- Консист Холькин Е.В. 13.08.2021 
	
	Начало1 = 4;
	Конец1 	= 3;
	
	Для Каждого Колонка Из Таблица1.Колонки Цикл
		
		ИмяКолонки = Колонка.Имя;
		Для Каждого ВыводимаяСтрока Из ВыводимыеКолонкиФайл1 Цикл
			
			ИмяВыводимойКолонки = ВыводимаяСтрока.Наименование;
			Если НРег(ИмяВыводимойКолонки) = НРег(ИмяКолонки) Тогда
				
				ИмяКолонки = ВыводимаяСтрока.Наименование;
				Область = Макет.ПолучитьОбласть("Шапка|Колонка");
				Область.Параметры.ИмяКолонки = ИмяКолонки;
				ТабДокумент.Присоединить(Область);
				Конец1 = Конец1 + 1;
				СоответствиеИменКолонок1.Вставить(ИмяКолонки, Конец1); //Консист Холькин Е.В. 13.08.2021 
				
			КонецЕсли;	
				
		КонецЦикла;
		
	КонецЦикла;	
	
	Область = Макет.ПолучитьОбласть("Шапка|Пробел");
	ТабДокумент.Присоединить(Область);
	
	Начало2 = Конец1 + 2;
	Конец2 	= Начало2 - 1;
	
	Для Каждого Колонка Из Таблица2.Колонки Цикл
		
		ИмяКолонки = Колонка.Имя;
		Для Каждого ВыводимаяСтрока Из ВыводимыеКолонкиФайл2 Цикл
			
			ИмяВыводимойКолонки = ВыводимаяСтрока.Наименование;
			Если НРег(ИмяВыводимойКолонки) = НРег(ИмяКолонки) Тогда
				
				ИмяКолонки = ВыводимаяСтрока.Наименование;
				Область = Макет.ПолучитьОбласть("Шапка|Колонка");
				Область.Параметры.ИмяКолонки = ИмяКолонки;
				ТабДокумент.Присоединить(Область);
				Конец2 = Конец2 + 1;
				СоответствиеИменКолонок2.Вставить(ИмяКолонки, Конец2); //Консист Холькин Е.В. 13.08.2021 
				
			КонецЕсли;	
				
		КонецЦикла;
		
	КонецЦикла;	
	
	// колонки для разницы таблиц
	Начало3 = 0;
	Конец3 	= 0;
	Если ВыводитьРазницу Тогда
		
		Начало3 = Конец2 + 2;
		Конец3 	= Начало3 - 1;
		
		Область = Макет.ПолучитьОбласть("Шапка|Пробел");
		ТабДокумент.Присоединить(Область);
		
		Для Каждого Строка Из СравнениеСтрок Цикл
			
			ТипКолонки1 = ПолучитьТипКолонки("1",Строка.Файл1);
			ТипКолонки2 = ПолучитьТипКолонки("2",Строка.Файл2);
			
			ЭтоЧисла = (ТипКолонки1 = "Число" И ТипКолонки2 = "Число");
			
			Если ЭтоЧисла Тогда
				
				ИмяКолонки1 = ПолучитьИмяКолонки("1",Строка.Файл1);
				ИмяКолонки2 = ПолучитьИмяКолонки("2",Строка.Файл2);
				
				Если ИмяКолонки1 = ИмяКолонки2 Тогда
					ИмяОбщейКолонки = ИмяКолонки1;
				Иначе
					ИмяОбщейКолонки = ИмяКолонки1 + " - " + ИмяКолонки2;
				КонецЕсли;	
				
				Область = Макет.ПолучитьОбласть("Шапка|Колонка");
				Область.Параметры.ИмяКолонки = ИмяОбщейКолонки;
				ТабДокумент.Присоединить(Область);
				Конец3 = Конец3 + 1;
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;	
	// ТабДокумент = Новый ТабличныйДокумент;
	// объединим соответствующие ячейки шапки и выведем соответствующие цены
	Область = ТабДокумент.Область(2,Начало1,2,Конец1);
	Область.Объединить();
	Область.Текст = ИмяФайла1;
	 
	Область = ТабДокумент.Область(2,Начало2,2,Конец2);
	Область.Объединить();
	Область.Текст = ИмяФайла2;
	
	Если ВыводитьРазницу Тогда
		Область = ТабДокумент.Область(2,Начало3,2,Конец3);
		Область.Объединить();
		Область.Текст = "Разница";
	КонецЕсли;	
	ТабДокумент.ФиксацияСверху  = 3;
	
	СтруктураДокумента.Вставить("Начало1"	,Начало1);
	СтруктураДокумента.Вставить("Конец1"	,Конец1);
	СтруктураДокумента.Вставить("Начало2"	,Начало2);
	СтруктураДокумента.Вставить("Конец2"	,Конец2);
	СтруктураДокумента.Вставить("Начало3"	,Начало3);
	СтруктураДокумента.Вставить("Конец3"	,Конец3);
	
КонецПроцедуры	

// вывод в табличный документ признака
Процедура ВывестиПризнак(ТабДокумент, Макет, Признак)
	
	Область = Макет.ПолучитьОбласть("Строка|Признак");
	Область.Параметры.Признак = Признак;
	ТабДокумент.Вывести(Область);
	
КонецПроцедуры	

// вывод в табличный документ имен отличающихся колонок
Процедура ВывестиРазныеКолонки(ТабДокумент, Макет, ИменаОтличающихсяКолонокФайла, Постфикс)
	
	Область = Макет.ПолучитьОбласть("Строка|РазныеКолонки" + Постфикс);
	
	Для Каждого Имя Из ИменаОтличающихсяКолонокФайла Цикл
		Запятая = ?(ЗначениеЗаполнено(Область.Параметры.РазныеКолонкиРасш), ",", "");
		//Область.Параметры.РазныеКолонки = Строка(Область.Параметры.РазныеКолонки) + Запятая + Имя;
		Область.Параметры.РазныеКолонкиРасш = Строка(Область.Параметры.РазныеКолонкиРасш) + Запятая + Имя;
	КонецЦикла;

	ТабДокумент.Присоединить(Область);
	
КонецПроцедуры

// вывод в табличный документ пробела
Процедура ВывестиПробел(ТабДокумент, Макет)
	
	Область = Макет.ПолучитьОбласть("Строка|Пробел");
	ТабДокумент.Присоединить(Область);
	
КонецПроцедуры	

// вывод строки
Процедура ВывестиСтроку(ТабДокумент, Макет, Режим, Таблица, Строка = Неопределено)
	
	ВыводимыеКолонки = ?(Режим = "1", ВыводимыеКолонкиФайл1, ВыводимыеКолонкиФайл2);
	
	Для Каждого Колонка Из Таблица.Колонки Цикл
		
		ИмяКолонки = Колонка.Имя;
		
		Для Каждого ВыводимаяСтрока Из ВыводимыеКолонки Цикл
			
			ИмяВыводимойКолонки = ВыводимаяСтрока.Наименование;
			
			Если НРег(ИмяВыводимойКолонки) = НРег(ИмяКолонки) Тогда
				
				Область = Макет.ПолучитьОбласть("Строка|Колонка");
				
				Значение = "";
				Если Строка <> Неопределено Тогда
					Значение = Строка[ИмяКолонки];
				КонецЕсли;	
				
				Область.Параметры.Значение = Значение;
				ТабДокумент.Присоединить(Область);
				
			КонецЕсли;	
				
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры	

// вывод разницы
Процедура ВывестиРазницу(ТабДокумент, Макет, Строка1 = Неопределено, Строка2 = Неопределено);
	
	Для Каждого Строка Из СравнениеСтрок Цикл
		
		ТипКолонки1 = ПолучитьТипКолонки("1",Строка.Файл1);
		ТипКолонки2 = ПолучитьТипКолонки("2",Строка.Файл2);
		
		ЭтоЧисла = (ТипКолонки1 = "Число" И ТипКолонки2 = "Число");
		
		Если ЭтоЧисла Тогда
			
			Значение1 = 0;
			Значение2 = 0;
			
			Если НЕ Строка1 = Неопределено Тогда
				ИмяКолонки 	= "К"+Строка.Файл1;
				Значение1 	= Строка1[ИмяКолонки];
			КонецЕсли;	
				
			Если НЕ Строка2 = Неопределено Тогда
				ИмяКолонки 	= "К"+Строка.Файл2;
				Значение2 	= Строка2[ИмяКолонки];
			КонецЕсли;	
			
			Разница = Значение1 - Значение2;
			
			Область = Макет.ПолучитьОбласть("Строка|Колонка");
			Область.Параметры.Значение = Разница;
			ТабДокумент.Присоединить(Область);
			
		КонецЕсли;	
			
	КонецЦикла;	
	
КонецПроцедуры	

// раскраска строк табличного документа
Процедура РаскраситьСтроки(ТабДокумент,СтруктураДокумента) Экспорт
	
	i = 1;
	Пока Истина Цикл
		
		ТекущаяСтрока = ПолучитьСтроку(i);
		
		Ячейка 	= ТабДокумент.Область("R"+ТекущаяСтрока+"C1");
		Признак 	= ПолучитьЧисло(Ячейка.Текст);
		
		//++ Консист Холькин Е.В. 13.08.2021 
		Ячейка1 = ТабДокумент.Область("R"+ТекущаяСтрока+"C2");
		РазныеКолонки1 = РазложитьСтрокуВМассивПодстрокЛокальная(Ячейка1.Расшифровка, ",", Истина);
		РазныеКолонки1Числом = Новый Массив;
		
		Для Каждого Колонка Из РазныеКолонки1 Цикл
			РазныеКолонки1Числом.Добавить(СоответствиеИменКолонок1.Получить(Колонка));
		КонецЦикла;
		
		Ячейка2 = ТабДокумент.Область("R"+ТекущаяСтрока+"C3");
		РазныеКолонки2 = РазложитьСтрокуВМассивПодстрокЛокальная(Ячейка2.Расшифровка, ",", Истина);
		РазныеКолонки2Числом = Новый Массив;
		
		Для Каждого Колонка Из РазныеКолонки2 Цикл
			РазныеКолонки2Числом.Добавить(СоответствиеИменКолонок2.Получить(Колонка));
		КонецЦикла;
		//-- Консист Холькин Е.В. 13.08.2021 
		
		Если НЕ ЗначениеЗаполнено(Признак) Тогда
			Прервать;
		КонецЕсли;
		
		// отличающиеся строки
		Если Признак = ПризнакНеРавно Тогда
			
			//++ Консист Холькин Е.В. 13.08.2021 
			//Область = ТабДокумент.Область(i,СтруктураДокумента.Начало1,i,СтруктураДокумента.Конец1);
			Для Каждого НомерКолонки Из РазныеКолонки1Числом Цикл  
				Область = ТабДокумент.Область(i,НомерКолонки,i,НомерКолонки);
				//-- Консист Холькин Е.В. 13.08.2021 
				Область.ЦветФона 	= ОтличаютсяЦветФона;
				Область.ЦветТекста 	= ОтличаютсяЦветШрифта;
			КонецЦикла;
			
			//++ Консист Холькин Е.В. 13.08.2021 
			//Область = ТабДокумент.Область(i,СтруктураДокумента.Начало2,i,СтруктураДокумента.Конец2);
			Для Каждого НомерКолонки Из РазныеКолонки2Числом Цикл
				Область = ТабДокумент.Область(i,НомерКолонки,i,НомерКолонки);
				//-- Консист Холькин Е.В. 13.08.2021 
				Область.ЦветФона 	= ОтличаютсяЦветФона;
				Область.ЦветТекста 	= ОтличаютсяЦветШрифта;
			КонецЦикла;
			
			Если ВыводитьРазницу Тогда
				Область = ТабДокумент.Область(i,СтруктураДокумента.Начало3,i,СтруктураДокумента.Конец3);
				Область.ЦветФона 	= ОтличаютсяЦветФона;
				Область.ЦветТекста 	= ОтличаютсяЦветШрифта;
			КонецЕсли;	
			
		// только в первом файле
		ИначеЕсли Признак = ПризнакТолько1 Тогда
			
			Область = ТабДокумент.Область(i,СтруктураДокумента.Начало1,i,СтруктураДокумента.Конец1);
			Область.ЦветФона 	= ТолькоВФайл1ЦветФона;
			Область.ЦветТекста 	= ТолькоВФайл1ЦветШрифта;
			
			Область = ТабДокумент.Область(i,СтруктураДокумента.Начало2,i,СтруктураДокумента.Конец2);
			Область.ЦветФона 	= ТолькоВФайл1ЦветФона;
			Область.ЦветТекста 	= ТолькоВФайл1ЦветШрифта;
			
			Если ВыводитьРазницу Тогда
				Область = ТабДокумент.Область(i,СтруктураДокумента.Начало3,i,СтруктураДокумента.Конец3);
				Область.ЦветФона 	= ТолькоВФайл1ЦветФона;
				Область.ЦветТекста 	= ТолькоВФайл1ЦветШрифта;
			КонецЕсли;	
			
		// только во втором файле
		ИначеЕсли Признак = ПризнакТолько2 Тогда
			
			Область = ТабДокумент.Область(i,СтруктураДокумента.Начало1,i,СтруктураДокумента.Конец1);
			Область.ЦветФона 	= ТолькоВФайл2ЦветФона;
			Область.ЦветТекста 	= ТолькоВФайл2ЦветШрифта;
			
			Область = ТабДокумент.Область(i,СтруктураДокумента.Начало2,i,СтруктураДокумента.Конец2);
			Область.ЦветФона 	= ТолькоВФайл2ЦветФона;
			Область.ЦветТекста 	= ТолькоВФайл2ЦветШрифта;
			
			Если ВыводитьРазницу Тогда
				Область = ТабДокумент.Область(i,СтруктураДокумента.Начало3,i,СтруктураДокумента.Конец3);
				Область.ЦветФона 	= ТолькоВФайл2ЦветФона;
				Область.ЦветТекста 	= ТолькоВФайл2ЦветШрифта;
			КонецЕсли;	
			
		КонецЕсли;	
		
		i = i + 1;
		
	КонецЦикла;	
	
КонецПроцедуры	

// получение числа
Функция ПолучитьЧисло(Знач ЗначениеЯчейки) Экспорт
	
	ЗначениеЯчейки = СокрЛП(ЗначениеЯчейки);	
	ЗначениеЯчейки = СтрЗаменить(ЗначениеЯчейки," ","");
	ЗначениеЯчейки = СтрЗаменить(ЗначениеЯчейки,Символ(160),"");
	
	РезультатЧислом = 0;
	Попытка
		РезультатЧислом = Число(ЗначениеЯчейки);
	Исключение
	КонецПопытки;
	
	Возврат РезультатЧислом;
	
КонецФункции	

// получение строки из числа
Функция ПолучитьСтроку(Знач Значение) Экспорт
	
	РезультатСтрокой = СокрЛП(Значение);
	РезультатСтрокой = СтрЗаменить(РезультатСтрокой," ","");
	РезультатСтрокой = СтрЗаменить(РезультатСтрокой,Символ(160),"");
	
	Возврат РезультатСтрокой;
	
КонецФункции

// расчет ширины колонок (честно содрано с диска ИТС :)
Процедура РасчетШириныКолонок(ТабличныйДокумент)
    
    Перем МаксимальноеКоличествоСтрок, МаксимальнаяШиринаКолонки;
    Перем КонечнаяСтрока, НачальнаяСтрока, ТекущаяКолонка, ТекущаяСтрока, НачалоДанных;
    Перем ОбластьШапки, ОбластьПодвала;
    Перем ШиринаКолонки, ТекстЯчейки, НомерСтрокиТекста;
    Перем КоличествоУровнейГруппировокСтрок, Отступ;
    Перем ШириныКолонок;
    
    // Максимальное количество строк отчета, которые будут использованы для расчета ширин колонок
    МаксимальноеКоличествоСтрок = 200;
	
    // Ограничение максимальной ширины колонки
    МаксимальнаяШиринаКолонки = 50;
	
    // Массив, в который будут помещаться ширины колонок
    ШириныКолонок = Новый Массив;
	
    // Получим количество уровней группировок в отчете для учета автоматического отступа
    КоличествоУровнейГруппировокСтрок = ТабличныйДокумент.КоличествоУровнейГруппировокСтрок();
    
    // Инициализируем начальные строки
    НачальнаяСтрока 	= 1;
    НачалоДанных 		= 1;
    КонечнаяСтрока 		= НачальнаяСтрока + МаксимальноеКоличествоСтрок;

	// Ограничим конечную строку
    КонечнаяСтрока = Мин(КонечнаяСтрока, ТабличныйДокумент.ВысотаТаблицы);
    
    // Переберем все колонки отчета
    Для ТекущаяКолонка = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
        
        АвтоОтступ = 0;
        
        // Переберем строки, которые будут использованы для расчета ширин колонок
        Для ТекущаяСтрока = НачальнаяСтрока По КонечнаяСтрока Цикл
            
            ШиринаКолонки = 0;

            // Получим область текущей ячейки
            ОбластьЯчейки = ТабличныйДокумент.Область(ТекущаяСтрока, ТекущаяКолонка);
            
            Если ОбластьЯчейки.Лево <> ТекущаяКолонка Или ОбластьЯчейки.Верх <> ТекущаяСтрока Тогда
                // Данная ячейка принадлежит объединенным ячейкам и не является начальной ячейкой
                Продолжить;
            КонецЕсли;
            
            Если КоличествоУровнейГруппировокСтрок > 0 И ТекущаяСтрока = НачалоДанных Тогда
                // Для первой строки с данными получим значение автоотступа
                АвтоОтступ = ОбластьЯчейки.АвтоОтступ;
            КонецЕсли;
            
            // Получим текст ячейки
            ТекстЯчейки = ОбластьЯчейки.Текст;
            
            // Для каждой строки из текста ячейки рассчитаем количество символов в строке
            Для НомерСтрокиТекста = 1 По СтрЧислоСтрок(ТекстЯчейки) Цикл
                
                ШиринаТекстаЯчейки = СтрДлина(СтрПолучитьСтроку(ТекстЯчейки, НомерСтрокиТекста));
                
                // Если используется автоотступ, то прибавим к ширине ячейки его величину
                Если АвтоОтступ <> Неопределено И АвтоОтступ > 0 Тогда
                    ШиринаТекстаЯчейки = ШиринаТекстаЯчейки + КоличествоУровнейГруппировокСтрок * АвтоОтступ;
                КонецЕсли;
                
                ШиринаКолонки = Макс(ШиринаКолонки, ШиринаТекстаЯчейки);

            КонецЦикла;

			// Ограничим ширину колонки
            Если ШиринаКолонки > МаксимальнаяШиринаКолонки Тогда
                ШиринаКолонки = МаксимальнаяШиринаКолонки;
            КонецЕсли;
            
            Если ШиринаКолонки <> 0 Тогда

				// Определим, сколько ячеек по ширине используется в области для текущей ячейки
                КоличествоКолонок = ОбластьЯчейки.Право - ОбластьЯчейки.Лево;
                
                // Переберем все ячейки, расположенные в области
                Для НомерКолонки = 0 По КоличествоКолонок Цикл
					
					// В массиве ширин колонок уже был элемент для текущей колонки
                    Если ШириныКолонок.ВГраница() > ТекущаяКолонка - 1 + НомерКолонки Тогда 
                        
                        // Значение ширины колонки еще не было установлено
                        Если ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки] = Неопределено Тогда
                            ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки] = ШиринаКолонки / (КоличествоКолонок + 1);
							
                        // Значение ширины колонки уже было установлено    
                        Иначе
                            // Вычислим максимум ширины колонки
                            ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки] = 
                                Макс(ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки], ШиринаКолонки / (КоличествоКолонок + 1));
                        КонецЕсли;
						
					// В массиве ширин колонок еще не было элемента для данной колонки	
                    Иначе
                        // Добавим элемент в массив ширин колонок
                        ШириныКолонок.Вставить(ТекущаяКолонка - 1 + НомерКолонки, ШиринаКолонки / (КоличествоКолонок + 1));
                    КонецЕсли;
                    
                КонецЦикла;
                
            КонецЕсли;
            
        КонецЦикла;    // Конец цикла перебора строк
 
    КонецЦикла;    // Конец цикла перебора колонок
 
    
    // Переберем все элементы в массиве вычисленных ширин колонок
    Для ТекущаяКолонка = 0 По ШириныКолонок.ВГраница() Цикл
		
		// Ширина колонок установлена
        Если ШириныКолонок[ТекущаяКолонка] <> Неопределено Тогда
 
            // Установим ширину области ячеек
            ТабличныйДокумент.Область(, ТекущаяКолонка + 1, НачалоДанных, ТекущаяКолонка + 1).ШиринаКолонки = ШириныКолонок[ТекущаяКолонка] + 1;
            
        КонецЕсли;
        
    КонецЦикла;

КонецПроцедуры

// формирование структуры отбора для обычого сравнения
Функция ПолучитьСтруктуруОтбора(Строка)
	
	Отбор = Новый Структура;
	Для Каждого СтрокаСопоставления Из СопоставлениеСтрок Цикл
		
		КолонкаФайл1 = СтрокаСопоставления.Файл1;
		КолонкаФайл2 = СтрокаСопоставления.Файл2;
		
		Если НеУчитыватьРегистр Тогда
			КолонкаФайл2 = КолонкаФайл2 + "Регистр";
		КонецЕсли;	
		
		ЗначениеОтбора = Строка[КолонкаФайл1];
		Если НеУчитыватьРегистр И ТипЗнч(ЗначениеОтбора) = Тип("Строка") Тогда
			ЗначениеОтбора = ВРег(ЗначениеОтбора);
		КонецЕсли;	
		
		Отбор.Вставить(КолонкаФайл2,ЗначениеОтбора);
		
	КонецЦикла;	
	
	Возврат Отбор;
	
КонецФункции	

// вывод расшифровки цветов
Процедура ВывестиРасшифровкуЦветов(ТабДокумент, Макет) Экспорт
	
	Область = Макет.ПолучитьОбласть("Расшифровка");
	ТабДокумент.Вывести(Область);

	// различаются
	Область = ТабДокумент.Области.Найти("ПризнакНеРавно");
	Область.ЦветФона = ОтличаютсяЦветФона;
	
	// только в первом файле
	Область = ТабДокумент.Области.Найти("ПризнакТолько1");
	Область.ЦветФона = ТолькоВФайл1ЦветФона;
	
	// только во втором файле
	Область = ТабДокумент.Области.Найти("ПризнакТолько2");
	Область.ЦветФона = ТолькоВФайл2ЦветФона;
	
КонецПроцедуры	

// преобразование числовых строк в числа
Процедура ДобавитьРегистронезависимыеКолонки(Режим,Таблица)
	
	ВыводимыеКолонки = ?(Режим = "1", ВыводимыеКолонкиФайл1, ВыводимыеКолонкиФайл2);
	
	Для Каждого ВыводимаяСтрока Из ВыводимыеКолонки Цикл
		
		Если ВыводимаяСтрока.ТипЗначения = "Текст" Тогда
			
			//<--РА:[04.01.2022][Холькин Е.В.][SD_17321/PR_5-13-4-2-21-6859]
			//ИмяВыводимойКолонки 			= "К"+ВыводимаяСтрока.НомерКолонки;
			ИмяВыводимойКолонки 			= ВыводимаяСтрока.Наименование;
			//-->РА:[04.01.2022][Холькин Е.В.][SD_17321/PR_5-13-4-2-21-6859]
			
			ИмяРегистронезависимойКолонки 	= ИмяВыводимойКолонки+"Регистр";
			
			Таблица.Колонки.Добавить(ИмяРегистронезависимойКолонки);
			
			Для Каждого Строка Из Таблица Цикл
				Строка[ИмяРегистронезависимойКолонки] = ВРег(Строка[ИмяВыводимойКолонки]);
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры	

// добавление регистронезависимой колонки
Процедура ПреобразоватьЧисловыеСтроки(Режим,Таблица)
	
	ВыводимыеКолонки = ?(Режим = "1", ВыводимыеКолонкиФайл1, ВыводимыеКолонкиФайл2);
	
	Для Каждого Строка Из Таблица Цикл
		
		Для Каждого ВыводимаяСтрока Из ВыводимыеКолонки Цикл
			
			Если ВыводимаяСтрока.ТипЗначения = "Число" Тогда
				
				ИмяВыводимойКолонки =ВыводимаяСтрока.Наименование;
				Строка[ИмяВыводимойКолонки] = ПолучитьЧисло(Строка[ИмяВыводимойКолонки]);
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЦикла;	
	
КонецПроцедуры	

// проверка возможности вывода разницы числовых колонок
Функция ПроверитьВозможностьВыводаРазницы()
	
	МожноВыводитьРазницу = Ложь;
	
	Если ВыводитьРазницуЧисловыхКолонокСравнения Тогда
		
		// проверим колонки сравнения и определим их тип
		мТаблицаСравнения = СравнениеСтрок.Выгрузить();
		мТаблицаСравнения.Колонки.Добавить("ТипЗначения1");
		мТаблицаСравнения.Колонки.Добавить("ТипЗначения2");
		
		Для Каждого Строка Из мТаблицаСравнения Цикл
			Строка.ТипЗначения1 = ПолучитьТипКолонки("1",Строка.Файл1);
			Строка.ТипЗначения2 = ПолучитьТипКолонки("2",Строка.Файл2);
		КонецЦикла;	
		
		Для Каждого Строка Из мТаблицаСравнения Цикл
			Если Строка.ТипЗначения1 = "Число" И Строка.ТипЗначения2 = "Число" Тогда
				МожноВыводитьРазницу = Истина;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;	
	
	Возврат МожноВыводитьРазницу;
	
КонецФункции	

// получить имя колонки по ее номеру (имя, заданное пользователем)
Функция ПолучитьИмяКолонки(Режим, НомерКолонки)
	
	ИменаКолонок 		= ?(Режим = "1", ИменаКолонок1, ИменаКолонок2);
	ВыводимыеКолонки 	= ?(Режим = "1", ВыводимыеКолонкиФайл1, ВыводимыеКолонкиФайл2);
	ИмяКолонки 			= "";
	
	Если ИменаКолонок.Количество() = 0 Тогда
		
		Для Каждого ВыводимаяСтрока Из ВыводимыеКолонки Цикл
			ИменаКолонок.Вставить(ВыводимаяСтрока.НомерКолонки,ВыводимаяСтрока.Наименование);
		КонецЦикла;	
		
	КонецЕсли;	
	
	ИмяКолонки = ИменаКолонок[НомерКолонки];
	Возврат ИмяКолонки;
		
КонецФункции	

// получить тип зачения колонки по ее номеру (тип, заданный пользователем)
Функция ПолучитьТипКолонки(Режим, НомерКолонки)
	
	ТипыКолонок 		= ?(Режим = "1", ТипыКолонок1, ТипыКолонок2);
	ВыводимыеКолонки 	= ?(Режим = "1", ВыводимыеКолонкиФайл1, ВыводимыеКолонкиФайл2);
	ТипКолонки 			= "Текст";
	
	Для Каждого ВыводимаяСтрока Из ВыводимыеКолонки Цикл
		ТипыКолонок.Вставить(ВыводимаяСтрока.НомерКолонки,ВыводимаяСтрока.ТипЗначения);
	КонецЦикла;	
	
	ТипКолонки = ТипыКолонок[НомерКолонки];
	Возврат ТипКолонки;
		
КонецФункции	

// автозаполнение выводимых колонок
Процедура АвтоЗаполнениеВыводимыхКолонок(Режим) Экспорт
	
	КолонкаНачало 		= ?(Режим = "1", Файл1НачальнаяКолонка, Файл2НачальнаяКолонка);
	КолонкаКонец 		= ?(Режим = "1", Файл1КонечнаяКолонка, Файл2КонечнаяКолонка);
	
	СтрокаНачало		= ?(Режим = "1", Файл1НачальнаяСтрока, Файл2НачальнаяСтрока);
	СтрокаКонец			= ?(Режим = "1", Файл1КонечнаяСтрока, Файл2КонечнаяСтрока);
	
	ВыводимыеКолонки 	= ?(Режим = "1", ВыводимыеКолонкиФайл1, ВыводимыеКолонкиФайл2);
	//мФайл				= ?(Режим = "1", Файл1, Файл2);
	
	Если КолонкаКонец < КолонкаНачало Тогда
		Возврат;
	КонецЕсли;
	
	//// случай 1: заголовка нет, заполним по умолчанию
	//Если СтрокаНачало = 1 Тогда
	//	
	//	ВыводимыеКолонки.Очистить();
	//	Для i = КолонкаНачало По КолонкаКонец Цикл
	//		НоваяСтрока = ВыводимыеКолонки.Добавить();
	//		НоваяСтрока.Наименование = "К"+i;
	//		НоваяСтрока.НомерКолонки = i;
	//		НоваяСтрока.ТипЗначения = "Текст";
	//	КонецЦикла;	
	//	
	//	// случай 2: возможно, есть заголовок
	//ИначеЕсли СтрокаНачало > 1 Тогда	
		
		
		ЗаполнитьВыводимыеКолонкиMXL(Режим);
		
		
	//КонецЕсли;	
	
КонецПроцедуры	

// заполнение выводимых колонок для файлов MXL
Процедура ЗаполнитьВыводимыеКолонкиMXL(Режим) Экспорт
	
	КолонкаНачало 		= ?(Режим = "1", Файл1НачальнаяКолонка, Файл2НачальнаяКолонка);
	КолонкаКонец 		= ?(Режим = "1", Файл1КонечнаяКолонка, Файл2КонечнаяКолонка);
	
	СтрокаНачало		= ?(Режим = "1", Файл1НачальнаяСтрока, Файл2НачальнаяСтрока);
	СтрокаКонец			= ?(Режим = "1", Файл1КонечнаяСтрока, Файл2КонечнаяСтрока);
	
	ВыводимыеКолонки 	= ?(Режим = "1", ВыводимыеКолонкиФайл1, ВыводимыеКолонкиФайл2);
	ТабДок				= ?(Режим = "1", Файл1ТабДок, Файл2ТабДок);
	
	СтрокаЗаголовка		= ПолучитьСтроку(СтрокаНачало );
	
	ВыводимыеКолонки.Очистить();
	
	// определяем наименования
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(
		ТабДок.Область("R" + СтрокаЗаголовка + "C" + КолонкаНачало + ":R" + Формат(СтрокаКонец, "ЧГ=0") + "C" + Формат(КолонкаКонец, "ЧГ=0")));
	Таблица = ПостроительЗапроса.Результат.Выгрузить();
	
	Для каждого Колонка Из Таблица.Колонки  Цикл
		
		НоваяСтрока = ВыводимыеКолонки.Добавить();
		НоваяСтрока.Наименование = Колонка.Имя;
		НоваяСтрока.НомерКолонки = Таблица.Колонки.Индекс(Колонка)+1;
		ТипЗначения =  Колонка.ТипЗначения;
		Если ТипЗначения.СодержитТип( Тип ("Строка")) Тогда
			НоваяСтрока.ТипЗначения = "Текст";
		Иначе
			НоваяСтрока.ТипЗначения = "Число";
		КонецЕсли;
		
	КонецЦикла; 
	
	// определяем типы
	//ИндексСтрокиВыводимыхКолонок = 0;
	//Для НомерКолонки = КолонкаНачало По КолонкаКонец Цикл
	//	
	//	Ячейка 			= ТабДок.Область("R"+СтрокаНачало+"C"+НомерКолонки);
	//	Значение 		= СокрЛП(Ячейка.Текст);
	//	ЗначениеЧисло 	= ПолучитьЧисло(Значение);

	//	мСтрока = ВыводимыеКолонки[ИндексСтрокиВыводимыхКолонок];
	//	мСтрока.ТипЗначения = "Текст";
	//	Если ЗначениеЧисло <> 0 Тогда
	//		мСтрока.ТипЗначения = "Число";
	//	КонецЕсли;	
	//	
	//	ИндексСтрокиВыводимыхКолонок = ИндексСтрокиВыводимыхКолонок + 1;
	//	
	//КонецЦикла;	
			
	// освободим память
	//ТабДок = 0;
	
КонецПроцедуры	

// автозаполнение начальных и конечных строк и колонок
Процедура АвтоЗаполнениеНачальныхКонечныхСтрокКолонок(Режим) Экспорт
	
	РеквизитКолонкаНачало 	= ?(Режим = "1", "Файл1НачальнаяКолонка", "Файл2НачальнаяКолонка");
	РеквизитКолонкаКонец 	= ?(Режим = "1", "Файл1КонечнаяКолонка", "Файл2КонечнаяКолонка");
	
	РеквизитСтрокаНачало	= ?(Режим = "1", "Файл1НачальнаяСтрока", "Файл2НачальнаяСтрока");
	РеквизитСтрокаКонец		= ?(Режим = "1", "Файл1КонечнаяСтрока", "Файл2КонечнаяСтрока");
	
	//мФайл					= ?(Режим = "1", Файл1, Файл2);
	//
	//Если НЕ ЗначениеЗаполнено(мФайл) Тогда
	//	Возврат;
	//КонецЕсли;
	
	ЭтотОбъект[РеквизитСтрокаНачало] = 1;
	ЭтотОбъект[РеквизитКолонкаНачало] = 1;
	
	СтруктураКонечныхЗначений = Неопределено;
	
	СтруктураКонечныхЗначений = ПолучитьСтруктуруКонечныхЗначенийMXL(Режим);
	
	Если СтруктураКонечныхЗначений <> Неопределено Тогда
		ЭтотОбъект[РеквизитСтрокаКонец] 	= СтруктураКонечныхЗначений.СтрокаКонец;
		ЭтотОбъект[РеквизитКолонкаКонец] 	= СтруктураКонечныхЗначений.КолонкаКонец;
	КонецЕсли;	
	
КонецПроцедуры	

// определение конечных параметров для файлов MXL
Функция ПолучитьСтруктуруКонечныхЗначенийMXL(Режим) Экспорт
	
	ТабДок				= ?(Режим = "1", Файл1ТабДок, Файл2ТабДок);
	СтруктураЗначений 	= Новый Структура("СтрокаКонец,КолонкаКонец");
	
		
	СтруктураЗначений.СтрокаКонец 	= ТабДок.ПолучитьРазмерОбластиДанныхПоВертикали();
	СтруктураЗначений.КолонкаКонец 	= ТабДок.ПолучитьРазмерОбластиДанныхПоГоризонтали();
	
		
	Возврат СтруктураЗначений;
	
КонецФункции	

// установка отборов по результатам сравнения
Процедура ОтображениеРезультатаУстановитьОтбор(РежимОтбора) Экспорт
	ТабДокумент = Результат;
	НужныйПризнак = 0;
	Если 		РежимОтбора = "ОтборВсе" 		Тогда НужныйПризнак = 0;
	ИначеЕсли 	РежимОтбора = "ОтборОтличия" 	Тогда НужныйПризнак = ПризнакНеРавно;	
	ИначеЕсли 	РежимОтбора = "Отбор1" 			Тогда НужныйПризнак = ПризнакТолько1;
	ИначеЕсли 	РежимОтбора = "Отбор2" 			Тогда НужныйПризнак = ПризнакТолько2;
	КонецЕсли;	
	
	i = 4;
	Пока Истина Цикл
		
		ТекущаяСтрока = ПолучитьСтроку(i);
		Ячейка = ТабДокумент.Область("R"+ТекущаяСтрока);
		
		Признак = ПолучитьЧисло(Ячейка.Текст);
		Если Признак = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если НужныйПризнак = 0 Тогда
			Ячейка.Видимость = Истина;
		ИначеЕсли Признак = НужныйПризнак Тогда	
			Ячейка.Видимость = Истина;
		Иначе
			Ячейка.Видимость = Ложь;
		КонецЕсли;	
			
		i = i + 1;	
			
	КонецЦикла;	
	Результат = ТабДокумент;		
КонецПроцедуры	

// инициализация исходных ширин колонок
Процедура УстановитьИсходнуюШиринуКолонок(ТабДокумент) Экспорт
	
	ИсходнаяШиринаКолонок = Новый Соответствие;
	КоличествоКолонок = ТабДокумент.ШиринаТаблицы;
	
	Для i = 1 По КоличествоКолонок Цикл
		
		ТекущаяКолонка = ПолучитьСтроку(i);
		Область = ТабДокумент.Область("C"+ТекущаяКолонка);
		ИсходнаяШиринаКолонок.Вставить(i,Область.ШиринаКолонки);
		
	КонецЦикла;	
	
КонецПроцедуры	

Функция РазложитьСтрокуВМассивПодстрокЛокальная(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено) Экспорт
	
	МассивПодстрок = Новый Массив;
	
	// для обеспечения обратной совместимости
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				МассивПодстрок.Добавить("");
			КонецЕсли;
			Возврат МассивПодстрок;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			МассивПодстрок.Добавить(Подстрока);
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		МассивПодстрок.Добавить(Строка);
	КонецЕсли;
	
	Возврат МассивПодстрок;
	
КонецФункции   

// цвета по-умолчанию
ОтличаютсяЦветФона 		= WebЦвета.Красный;
ОтличаютсяЦветШрифта 	= WebЦвета.Белый;
	
ТолькоВФайл1ЦветФона 	= WebЦвета.Желтый;
ТолькоВФайл1ЦветШрифта 	= WebЦвета.Черный;

ТолькоВФайл2ЦветФона 	= WebЦвета.БледноЗеленый;
ТолькоВФайл2ЦветШрифта 	= WebЦвета.Черный;

// признаки сравнения
ПризнакРавно	= 7;
ПризнакНеРавно 	= 6;
ПризнакТолько1 	= 1;
ПризнакТолько2 	= 2;

// адрес разработки на Infostart.ru
АдресСтраницы = "http://infostart.ru/public/152745/";